/* automatically generated by rust-bindgen 0.69.4 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

use std::ops::{Deref, Not};

#[derive(Clone, Debug, PartialEq, Eq)]
#[repr(u32)]
pub enum BOOL {
	FALSE = 0,
	TRUE = 1,
}

impl Default for BOOL {
	fn default() -> Self {
		Self::FALSE
	}
}

impl Not for BOOL {
	type Output = bool;

	fn not(self) -> Self::Output {
		!match self {
			BOOL::FALSE => false,
			_ => true,
		}
	}
}

impl AsRef<bool> for BOOL {
	fn as_ref(&self) -> &bool {
		&self
	}
}

// impl Into<bool> for BOOL {
// 	fn into(self) -> bool {
// 		match self {
// 			BOOL::FALSE => false,
// 			_ => true,
// 		}
// 	}
// }

impl From<BOOL> for bool {
	fn from(value: BOOL) -> Self {
		match value {
			BOOL::FALSE => false,
			_ => true,
		}
	}
}

impl Deref for BOOL {
	type Target = bool;

	fn deref(&self) -> &Self::Target {
		match self {
			BOOL::FALSE => &false,
			_ => &true,
		}
	}
}

impl From<BOOL> for DWORD {
	fn from(value: BOOL) -> DWORD {
		// DWORD(value as u32)
		value as u32
	}
}

// impl From<BOOL> for u32 {
// 	fn from(value: BOOL) -> Self {
// 		value as u32
// 	}
// }

pub const TRUE: BOOL = BOOL::TRUE;
pub const FALSE: BOOL = BOOL::FALSE;

pub const BASSVERSION: u32 = 516;
#[allow(unsafe_code)]
pub const BASSVERSIONTEXT: &::std::ffi::CStr =
    unsafe { ::std::ffi::CStr::from_bytes_with_nul_unchecked(b"2.4\0") };
pub const BASS_OK: u32 = 0;
pub const BASS_ERROR_MEM: u32 = 1;

        &self.0
    }
}
impl ::std::ops::DerefMut for HCHANNEL {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HSTREAM(pub DWORD);
impl ::std::ops::Deref for HSTREAM {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HSTREAM {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HRECORD(pub DWORD);
impl ::std::ops::Deref for HRECORD {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HRECORD {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HSYNC(pub DWORD);
impl ::std::ops::Deref for HSYNC {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HSYNC {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HDSP(pub DWORD);
impl ::std::ops::Deref for HDSP {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HDSP {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HFX(pub DWORD);
impl ::std::ops::Deref for HFX {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HFX {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HPLUGIN(pub DWORD);
impl ::std::ops::Deref for HPLUGIN {
    type Target = DWORD;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for HPLUGIN {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[doc = " Device info structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_DEVICEINFO {
    #[doc = " description"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " driver"]
    pub driver: *const ::std::os::raw::c_char,
    pub flags: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_DEVICEINFO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DEVICEINFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DEVICEINFO>(),
        24usize,
        concat!("Size of: ", stringify!(BASS_DEVICEINFO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DEVICEINFO>(),
        8usize,
        concat!("Alignment of ", stringify!(BASS_DEVICEINFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DEVICEINFO),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).driver) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DEVICEINFO),
            "::",
            stringify!(driver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DEVICEINFO),
            "::",
            stringify!(flags)
        )
    );
}
impl Default for BASS_DEVICEINFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct BASS_INFO {
    #[doc = " device capabilities (DSCAPS_xxx flags)"]
    pub flags: DWORD,
    #[doc = " unused"]
    pub hwsize: DWORD,
    #[doc = " unused"]
    pub hwfree: DWORD,
    #[doc = " unused"]
    pub freesam: DWORD,
    #[doc = " unused"]
    pub free3d: DWORD,
    #[doc = " unused"]
    pub minrate: DWORD,
    #[doc = " unused"]
    pub maxrate: DWORD,
    #[doc = " unused"]
    pub eax: BOOL,
    #[doc = " recommended minimum buffer length in ms"]
    pub minbuf: DWORD,
    #[doc = " DirectSound version"]
    pub dsver: DWORD,
    #[doc = " average delay (in ms) before start of playback"]
    pub latency: DWORD,
    #[doc = " BASS_Init \"flags\" parameter"]
    pub initflags: DWORD,
    #[doc = " number of speakers available"]
    pub speakers: DWORD,
    #[doc = " current output rate"]
    pub freq: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_INFO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_INFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_INFO>(),
        56usize,
        concat!("Size of: ", stringify!(BASS_INFO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_INFO>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_INFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hwsize) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(hwsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hwfree) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(hwfree)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freesam) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(freesam)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free3d) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(free3d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minrate) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(minrate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxrate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(maxrate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eax) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(eax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minbuf) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(minbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dsver) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(dsver)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latency) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initflags) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(initflags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).speakers) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(speakers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_INFO),
            "::",
            stringify!(freq)
        )
    );
}
impl Default for BASS_INFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for BASS_INFO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "BASS_INFO {{ flags: {:?}, hwsize: {:?}, hwfree: {:?}, freesam: {:?}, free3d: {:?}, minrate: {:?}, maxrate: {:?}, minbuf: {:?}, dsver: {:?}, latency: {:?}, initflags: {:?}, speakers: {:?}, freq: {:?} }}" , self . flags , self . hwsize , self . hwfree , self . freesam , self . free3d , self . minrate , self . maxrate , self . minbuf , self . dsver , self . latency , self . initflags , self . speakers , self . freq)
    }
}
#[doc = " Recording device info structure"]
#[repr(C)]
pub struct BASS_RECORDINFO {
    #[doc = " device capabilities (DSCCAPS_xxx flags)"]
    pub flags: DWORD,
    #[doc = " supported standard formats (WAVE_FORMAT_xxx flags)"]
    pub formats: DWORD,
    #[doc = " number of inputs"]
    pub inputs: DWORD,
    #[doc = " TRUE = only 1 input can be set at a time"]
    pub singlein: BOOL,
    #[doc = " current input rate"]
    pub freq: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_RECORDINFO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_RECORDINFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_RECORDINFO>(),
        20usize,
        concat!("Size of: ", stringify!(BASS_RECORDINFO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_RECORDINFO>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_RECORDINFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_RECORDINFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formats) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_RECORDINFO),
            "::",
            stringify!(formats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inputs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_RECORDINFO),
            "::",
            stringify!(inputs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).singlein) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_RECORDINFO),
            "::",
            stringify!(singlein)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_RECORDINFO),
            "::",
            stringify!(freq)
        )
    );
}
impl Default for BASS_RECORDINFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for BASS_RECORDINFO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "BASS_RECORDINFO {{ flags: {:?}, formats: {:?}, inputs: {:?}, freq: {:?} }}",
            self.flags, self.formats, self.inputs, self.freq
        )
    }
}
#[doc = " Sample info structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_SAMPLE {
    #[doc = " default playback rate"]
    pub freq: DWORD,
    #[doc = " default volume (0-1)"]
    pub volume: f32,
    #[doc = " default pan (-1=left, 0=middle, 1=right)"]
    pub pan: f32,
    #[doc = " BASS_SAMPLE_xxx flags"]
    pub flags: DWORD,
    #[doc = " length (in bytes)"]
    pub length: DWORD,
    #[doc = " maximum simultaneous playbacks"]
    pub max: DWORD,
    #[doc = " original resolution"]
    pub origres: DWORD,
    #[doc = " number of channels"]
    pub chans: DWORD,
    #[doc = " minimum gap (ms) between creating channels"]
    pub mingap: DWORD,
    #[doc = " BASS_3DMODE_xxx mode"]
    pub mode3d: DWORD,
    #[doc = " minimum distance"]
    pub mindist: f32,
    #[doc = " maximum distance"]
    pub maxdist: f32,
    #[doc = " angle of inside projection cone"]
    pub iangle: DWORD,
    #[doc = " angle of outside projection cone"]
    pub oangle: DWORD,
    #[doc = " delta-volume outside the projection cone"]
    pub outvol: f32,
    #[doc = " unused"]
    pub vam: DWORD,
    #[doc = " unused"]
    pub priority: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_SAMPLE() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_SAMPLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_SAMPLE>(),
        68usize,
        concat!("Size of: ", stringify!(BASS_SAMPLE))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_SAMPLE>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_SAMPLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).volume) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pan) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(pan)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origres) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(origres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chans) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(chans)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mingap) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(mingap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode3d) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(mode3d)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mindist) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(mindist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxdist) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(maxdist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iangle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(iangle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oangle) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(oangle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outvol) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(outvol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vam) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(vam)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_SAMPLE),
            "::",
            stringify!(priority)
        )
    );
}
#[doc = " Channel info structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_CHANNELINFO {
    #[doc = " default playback rate"]
    pub freq: DWORD,
    #[doc = " channels"]
    pub chans: DWORD,
    pub flags: DWORD,
    #[doc = " type of channel"]
    pub ctype: DWORD,
    #[doc = " original resolution"]
    pub origres: DWORD,
    pub plugin: HPLUGIN,
    pub sample: HSAMPLE,
    pub filename: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BASS_CHANNELINFO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_CHANNELINFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_CHANNELINFO>(),
        40usize,
        concat!("Size of: ", stringify!(BASS_CHANNELINFO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_CHANNELINFO>(),
        8usize,
        concat!("Alignment of ", stringify!(BASS_CHANNELINFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chans) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(chans)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctype) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(ctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origres) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(origres)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plugin) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(plugin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(sample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filename) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_CHANNELINFO),
            "::",
            stringify!(filename)
        )
    );
}
impl Default for BASS_CHANNELINFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_PLUGINFORM {
    #[doc = " channel type"]
    pub ctype: DWORD,
    #[doc = " format description"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " file extension filter (*.ext1;*.ext2;etc...)"]
    pub exts: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BASS_PLUGINFORM() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_PLUGINFORM> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_PLUGINFORM>(),
        24usize,
        concat!("Size of: ", stringify!(BASS_PLUGINFORM))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_PLUGINFORM>(),
        8usize,
        concat!("Alignment of ", stringify!(BASS_PLUGINFORM))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGINFORM),
            "::",
            stringify!(ctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGINFORM),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGINFORM),
            "::",
            stringify!(exts)
        )
    );
}
impl Default for BASS_PLUGINFORM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_PLUGININFO {
    #[doc = " version (same form as BASS_GetVersion)"]
    pub version: DWORD,
    #[doc = " number of formats"]
    pub formatc: DWORD,
    #[doc = " the array of formats"]
    pub formats: *const BASS_PLUGINFORM,
}
#[test]
fn bindgen_test_layout_BASS_PLUGININFO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_PLUGININFO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_PLUGININFO>(),
        16usize,
        concat!("Size of: ", stringify!(BASS_PLUGININFO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_PLUGININFO>(),
        8usize,
        concat!("Alignment of ", stringify!(BASS_PLUGININFO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGININFO),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGININFO),
            "::",
            stringify!(formatc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formats) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_PLUGININFO),
            "::",
            stringify!(formats)
        )
    );
}
impl Default for BASS_PLUGININFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " 3D vector (for 3D positions/velocities/orientations)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_3DVECTOR {
    #[doc = " +=right, -=left"]
    pub x: f32,
    #[doc = " +=up, -=down"]
    pub y: f32,
    #[doc = " +=front, -=behind"]
    pub z: f32,
}
#[test]
fn bindgen_test_layout_BASS_3DVECTOR() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_3DVECTOR> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_3DVECTOR>(),
        12usize,
        concat!("Size of: ", stringify!(BASS_3DVECTOR))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_3DVECTOR>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_3DVECTOR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_3DVECTOR),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_3DVECTOR),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_3DVECTOR),
            "::",
            stringify!(z)
        )
    );
}
pub type STREAMPROC = ::std::option::Option<
    unsafe extern "C" fn(
        handle: HSTREAM,
        buffer: *mut ::std::os::raw::c_void,
        length: DWORD,
        user: *mut ::std::os::raw::c_void,
    ) -> DWORD,
>;
#[doc = " User file stream callback functions"]
pub type FILECLOSEPROC =
    ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void)>;
pub type FILELENPROC =
    ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void) -> QWORD>;
pub type FILEREADPROC = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut ::std::os::raw::c_void,
        length: DWORD,
        user: *mut ::std::os::raw::c_void,
    ) -> DWORD,
>;
pub type FILESEEKPROC = ::std::option::Option<
    unsafe extern "C" fn(offset: QWORD, user: *mut ::std::os::raw::c_void) -> BOOL,
>;
#[repr(C)]
#[derive(Debug, Default, Hash, PartialEq, Eq)]
pub struct BASS_FILEPROCS {
    pub close: FILECLOSEPROC,
    pub length: FILELENPROC,
    pub read: FILEREADPROC,
    pub seek: FILESEEKPROC,
}
#[test]
fn bindgen_test_layout_BASS_FILEPROCS() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_FILEPROCS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_FILEPROCS>(),
        32usize,
        concat!("Size of: ", stringify!(BASS_FILEPROCS))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_FILEPROCS>(),
        8usize,
        concat!("Alignment of ", stringify!(BASS_FILEPROCS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FILEPROCS),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FILEPROCS),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FILEPROCS),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FILEPROCS),
            "::",
            stringify!(seek)
        )
    );
}
pub type DOWNLOADPROC = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *const ::std::os::raw::c_void,
        length: DWORD,
        user: *mut ::std::os::raw::c_void,
    ),
>;
pub type SYNCPROC = ::std::option::Option<
    unsafe extern "C" fn(
        handle: HSYNC,
        channel: DWORD,
        data: DWORD,
        user: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " Sync callback function.\nhandle : The sync that has occured\nchannel: Channel that the sync occured in\ndata   : Additional data associated with the sync's occurance\nuser   : The 'user' parameter given when calling BASS_ChannelSetSync"]
pub type DSPPROC = ::std::option::Option<
    unsafe extern "C" fn(
        handle: HDSP,
        channel: DWORD,
        buffer: *mut ::std::os::raw::c_void,
        length: DWORD,
        user: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " DSP callback function.\nhandle : The DSP handle\nchannel: Channel that the DSP is being applied to\nbuffer : Buffer to apply the DSP to\nlength : Number of bytes in the buffer\nuser   : The 'user' parameter given when calling BASS_ChannelSetDSP"]
pub type RECORDPROC = ::std::option::Option<
    unsafe extern "C" fn(
        handle: HRECORD,
        buffer: *const ::std::os::raw::c_void,
        length: DWORD,
        user: *mut ::std::os::raw::c_void,
    ) -> BOOL,
>;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct tWAVEFORMATEX {
    pub wFormatTag: WORD,
    pub nChannels: WORD,
    pub nSamplesPerSec: DWORD,
    pub nAvgBytesPerSec: DWORD,
    pub nBlockAlign: WORD,
    pub wBitsPerSample: WORD,
    pub cbSize: WORD,
}
#[test]
fn bindgen_test_layout_tWAVEFORMATEX() {
    const UNINIT: ::std::mem::MaybeUninit<tWAVEFORMATEX> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tWAVEFORMATEX>(),
        18usize,
        concat!("Size of: ", stringify!(tWAVEFORMATEX))
    );
    assert_eq!(
        ::std::mem::align_of::<tWAVEFORMATEX>(),
        1usize,
        concat!("Alignment of ", stringify!(tWAVEFORMATEX))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wFormatTag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(wFormatTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nChannels) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(nChannels)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nSamplesPerSec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(nSamplesPerSec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nAvgBytesPerSec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(nAvgBytesPerSec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nBlockAlign) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(nBlockAlign)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wBitsPerSample) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(wBitsPerSample)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tWAVEFORMATEX),
            "::",
            stringify!(cbSize)
        )
    );
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct WAVEFORMATEX(pub tWAVEFORMATEX);
impl ::std::ops::Deref for WAVEFORMATEX {
    type Target = tWAVEFORMATEX;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for WAVEFORMATEX {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct PWAVEFORMATEX(pub *mut tWAVEFORMATEX);
impl ::std::ops::Deref for PWAVEFORMATEX {
    type Target = *mut tWAVEFORMATEX;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for PWAVEFORMATEX {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct LPWAVEFORMATEX(pub *mut tWAVEFORMATEX);
impl ::std::ops::Deref for LPWAVEFORMATEX {
    type Target = *mut tWAVEFORMATEX;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for LPWAVEFORMATEX {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct LPCWAVEFORMATEX(pub *const WAVEFORMATEX);
impl ::std::ops::Deref for LPCWAVEFORMATEX {
    type Target = *const WAVEFORMATEX;
    #[inline]
    fn deref(&self) -> &Self::Target {
        &self.0
    }
}
impl ::std::ops::DerefMut for LPCWAVEFORMATEX {
    #[inline]
    fn deref_mut(&mut self) -> &mut Self::Target {
        &mut self.0
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_CHORUS {
    pub fWetDryMix: f32,
    pub fDepth: f32,
    pub fFeedback: f32,
    pub fFrequency: f32,
    #[doc = " 0=triangle, 1=sine"]
    pub lWaveform: DWORD,
    pub fDelay: f32,
    #[doc = " BASS_DX8_PHASE_xxx"]
    pub lPhase: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_DX8_CHORUS() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_CHORUS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_CHORUS>(),
        28usize,
        concat!("Size of: ", stringify!(BASS_DX8_CHORUS))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_CHORUS>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_CHORUS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fWetDryMix) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(fWetDryMix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fDepth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(fDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fFeedback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(fFeedback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fFrequency) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(fFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lWaveform) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(lWaveform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fDelay) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(fDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lPhase) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_CHORUS),
            "::",
            stringify!(lPhase)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_COMPRESSOR {
    pub fGain: f32,
    pub fAttack: f32,
    pub fRelease: f32,
    pub fThreshold: f32,
    pub fRatio: f32,
    pub fPredelay: f32,
}
#[test]
fn bindgen_test_layout_BASS_DX8_COMPRESSOR() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_COMPRESSOR> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_COMPRESSOR>(),
        24usize,
        concat!("Size of: ", stringify!(BASS_DX8_COMPRESSOR))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_COMPRESSOR>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_COMPRESSOR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fGain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fAttack) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fAttack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRelease) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fRelease)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fThreshold) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fThreshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRatio) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPredelay) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_COMPRESSOR),
            "::",
            stringify!(fPredelay)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_DISTORTION {
    pub fGain: f32,
    pub fEdge: f32,
    pub fPostEQCenterFrequency: f32,
    pub fPostEQBandwidth: f32,
    pub fPreLowpassCutoff: f32,
}
#[test]
fn bindgen_test_layout_BASS_DX8_DISTORTION() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_DISTORTION> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_DISTORTION>(),
        20usize,
        concat!("Size of: ", stringify!(BASS_DX8_DISTORTION))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_DISTORTION>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_DISTORTION))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fGain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_DISTORTION),
            "::",
            stringify!(fGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fEdge) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_DISTORTION),
            "::",
            stringify!(fEdge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPostEQCenterFrequency) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_DISTORTION),
            "::",
            stringify!(fPostEQCenterFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPostEQBandwidth) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_DISTORTION),
            "::",
            stringify!(fPostEQBandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fPreLowpassCutoff) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_DISTORTION),
            "::",
            stringify!(fPreLowpassCutoff)
        )
    );
}
#[repr(C)]
pub struct BASS_DX8_ECHO {
    pub fWetDryMix: f32,
    pub fFeedback: f32,
    pub fLeftDelay: f32,
    pub fRightDelay: f32,
    pub lPanDelay: BOOL,
}
#[test]
fn bindgen_test_layout_BASS_DX8_ECHO() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_ECHO> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_ECHO>(),
        20usize,
        concat!("Size of: ", stringify!(BASS_DX8_ECHO))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_ECHO>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_ECHO))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fWetDryMix) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_ECHO),
            "::",
            stringify!(fWetDryMix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fFeedback) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_ECHO),
            "::",
            stringify!(fFeedback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fLeftDelay) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_ECHO),
            "::",
            stringify!(fLeftDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fRightDelay) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_ECHO),
            "::",
            stringify!(fRightDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lPanDelay) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_ECHO),
            "::",
            stringify!(lPanDelay)
        )
    );
}
impl Default for BASS_DX8_ECHO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for BASS_DX8_ECHO {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "BASS_DX8_ECHO {{ fWetDryMix: {:?}, fFeedback: {:?}, fLeftDelay: {:?}, fRightDelay: {:?} }}" , self . fWetDryMix , self . fFeedback , self . fLeftDelay , self . fRightDelay)
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_FLANGER {
    pub fWetDryMix: f32,
    pub fDepth: f32,
    pub fFeedback: f32,
    pub fFrequency: f32,
    #[doc = " 0=triangle, 1=sine"]
    pub lWaveform: DWORD,
    pub fDelay: f32,
    #[doc = " BASS_DX8_PHASE_xxx"]
    pub lPhase: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_DX8_FLANGER() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_FLANGER> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_FLANGER>(),
        28usize,
        concat!("Size of: ", stringify!(BASS_DX8_FLANGER))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_FLANGER>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_FLANGER))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fWetDryMix) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(fWetDryMix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fDepth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(fDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fFeedback) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(fFeedback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fFrequency) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(fFrequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lWaveform) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(lWaveform)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fDelay) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(fDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lPhase) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_FLANGER),
            "::",
            stringify!(lPhase)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_DX8_GARGLE {
    #[doc = " Rate of modulation in hz"]
    pub dwRateHz: DWORD,
    #[doc = " 0=triangle, 1=square"]
    pub dwWaveShape: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_DX8_GARGLE() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_GARGLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_GARGLE>(),
        8usize,
        concat!("Size of: ", stringify!(BASS_DX8_GARGLE))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_GARGLE>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_GARGLE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwRateHz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_GARGLE),
            "::",
            stringify!(dwRateHz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dwWaveShape) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_GARGLE),
            "::",
            stringify!(dwWaveShape)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_I3DL2REVERB {
    #[doc = " [-10000, 0]      default: -1000 mB"]
    pub lRoom: ::std::os::raw::c_int,
    #[doc = " [-10000, 0]      default: 0 mB"]
    pub lRoomHF: ::std::os::raw::c_int,
    #[doc = " [0.0, 10.0]      default: 0.0"]
    pub flRoomRolloffFactor: f32,
    #[doc = " [0.1, 20.0]      default: 1.49s"]
    pub flDecayTime: f32,
    #[doc = " [0.1, 2.0]       default: 0.83"]
    pub flDecayHFRatio: f32,
    #[doc = " [-10000, 1000]   default: -2602 mB"]
    pub lReflections: ::std::os::raw::c_int,
    #[doc = " [0.0, 0.3]       default: 0.007 s"]
    pub flReflectionsDelay: f32,
    #[doc = " [-10000, 2000]   default: 200 mB"]
    pub lReverb: ::std::os::raw::c_int,
    #[doc = " [0.0, 0.1]       default: 0.011 s"]
    pub flReverbDelay: f32,
    #[doc = " [0.0, 100.0]     default: 100.0 %"]
    pub flDiffusion: f32,
    #[doc = " [0.0, 100.0]     default: 100.0 %"]
    pub flDensity: f32,
    #[doc = " [20.0, 20000.0]  default: 5000.0 Hz"]
    pub flHFReference: f32,
}
#[test]
fn bindgen_test_layout_BASS_DX8_I3DL2REVERB() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_I3DL2REVERB> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_I3DL2REVERB>(),
        48usize,
        concat!("Size of: ", stringify!(BASS_DX8_I3DL2REVERB))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_I3DL2REVERB>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_I3DL2REVERB))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lRoom) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(lRoom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lRoomHF) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(lRoomHF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flRoomRolloffFactor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flRoomRolloffFactor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flDecayTime) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flDecayTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flDecayHFRatio) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flDecayHFRatio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lReflections) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(lReflections)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flReflectionsDelay) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flReflectionsDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lReverb) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(lReverb)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flReverbDelay) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flReverbDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flDiffusion) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flDiffusion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flDensity) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flDensity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flHFReference) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_I3DL2REVERB),
            "::",
            stringify!(flHFReference)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_PARAMEQ {
    pub fCenter: f32,
    pub fBandwidth: f32,
    pub fGain: f32,
}
#[test]
fn bindgen_test_layout_BASS_DX8_PARAMEQ() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_PARAMEQ> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_PARAMEQ>(),
        12usize,
        concat!("Size of: ", stringify!(BASS_DX8_PARAMEQ))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_PARAMEQ>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_PARAMEQ))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fCenter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_PARAMEQ),
            "::",
            stringify!(fCenter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fBandwidth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_PARAMEQ),
            "::",
            stringify!(fBandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fGain) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_PARAMEQ),
            "::",
            stringify!(fGain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_REVERB {
    #[doc = " [-96.0,0.0]            default: 0.0 dB"]
    pub fInGain: f32,
    #[doc = " [-96.0,0.0]            default: 0.0 db"]
    pub fReverbMix: f32,
    #[doc = " [0.001,3000.0]         default: 1000.0 ms"]
    pub fReverbTime: f32,
    #[doc = " [0.001,0.999]          default: 0.001"]
    pub fHighFreqRTRatio: f32,
}
#[test]
fn bindgen_test_layout_BASS_DX8_REVERB() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_DX8_REVERB> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_DX8_REVERB>(),
        16usize,
        concat!("Size of: ", stringify!(BASS_DX8_REVERB))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_DX8_REVERB>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_DX8_REVERB))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fInGain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_REVERB),
            "::",
            stringify!(fInGain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fReverbMix) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_REVERB),
            "::",
            stringify!(fReverbMix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fReverbTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_REVERB),
            "::",
            stringify!(fReverbTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fHighFreqRTRatio) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_DX8_REVERB),
            "::",
            stringify!(fHighFreqRTRatio)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_FX_VOLUME_PARAM {
    pub fTarget: f32,
    pub fCurrent: f32,
    pub fTime: f32,
    pub lCurve: DWORD,
}
#[test]
fn bindgen_test_layout_BASS_FX_VOLUME_PARAM() {
    const UNINIT: ::std::mem::MaybeUninit<BASS_FX_VOLUME_PARAM> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BASS_FX_VOLUME_PARAM>(),
        16usize,
        concat!("Size of: ", stringify!(BASS_FX_VOLUME_PARAM))
    );
    assert_eq!(
        ::std::mem::align_of::<BASS_FX_VOLUME_PARAM>(),
        4usize,
        concat!("Alignment of ", stringify!(BASS_FX_VOLUME_PARAM))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fTarget) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FX_VOLUME_PARAM),
            "::",
            stringify!(fTarget)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fCurrent) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FX_VOLUME_PARAM),
            "::",
            stringify!(fCurrent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fTime) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FX_VOLUME_PARAM),
            "::",
            stringify!(fTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lCurve) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BASS_FX_VOLUME_PARAM),
            "::",
            stringify!(lCurve)
        )
    );
}
pub type IOSNOTIFYPROC = ::std::option::Option<unsafe extern "C" fn(status: DWORD)>;
extern crate libloading;
pub struct BASS {
    __library: ::libloading::Library,
    pub BASS_SetConfig: unsafe extern "C" fn(option: DWORD, value: DWORD) -> BOOL,
    pub BASS_GetConfig: unsafe extern "C" fn(option: DWORD) -> DWORD,
    pub BASS_SetConfigPtr:
        unsafe extern "C" fn(option: DWORD, value: *const ::std::os::raw::c_void) -> BOOL,
    pub BASS_GetConfigPtr: unsafe extern "C" fn(option: DWORD) -> *const ::std::os::raw::c_void,
    pub BASS_GetVersion: unsafe extern "C" fn() -> DWORD,
    pub BASS_ErrorGetCode: unsafe extern "C" fn() -> ::std::os::raw::c_int,
    pub BASS_GetDeviceInfo: unsafe extern "C" fn(device: DWORD, info: *mut BASS_DEVICEINFO) -> BOOL,
    pub BASS_Init: unsafe extern "C" fn(
        device: ::std::os::raw::c_int,
