/* automatically generated by rust-bindgen 0.69.4 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

/// Exists because Bindgen doesn't handle it, because they're weird functions sort of defined in the header?
pub use super::makelong::*;

use std::ops::{Deref, Not};

#[derive(Clone, Debug, PartialEq, Eq)]
#[repr(u32)]
pub enum BOOL {
	FALSE = 0,
	TRUE = 1,
}

impl BOOL {
	pub fn ok(&self) -> bool {
		self.is_true()
	}

	pub fn is_true(&self) -> bool {
		*self == BOOL::TRUE
	}

	pub fn is_false(&self) -> bool {
		*self == BOOL::FALSE
	}
}

impl Default for BOOL {
	fn default() -> Self {
		Self::FALSE
	}
}

impl Not for BOOL {
	type Output = bool;

	fn not(self) -> Self::Output {
		!match self {
			BOOL::FALSE => false,
			_ => true,
		}
	}
}

impl AsRef<bool> for BOOL {
	fn as_ref(&self) -> &bool {
		&self
	}
}

// impl Into<bool> for BOOL {
// 	fn into(self) -> bool {
// 		match self {
// 			BOOL::FALSE => false,
// 			_ => true,
// 		}
// 	}
// }

impl From<BOOL> for bool {
	fn from(value: BOOL) -> Self {
		match value {
			BOOL::FALSE => false,
			_ => true,
		}
	}
}

impl From<bool> for BOOL {
	fn from(value: bool) -> Self {
		if value {
			BOOL::TRUE
		} else {
			BOOL::FALSE
		}
	}
}

impl Deref for BOOL {
	type Target = bool;

	fn deref(&self) -> &Self::Target {
		match self {
			BOOL::FALSE => &false,
			_ => &true,
		}
	}
}

impl From<BOOL> for DWORD {
	fn from(value: BOOL) -> DWORD {
		DWORD(value as u32) // NewType

#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HSAMPLE(pub DWORD);
impl ::std::ops::Deref for HSAMPLE {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HSAMPLE {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HCHANNEL(pub DWORD);
impl ::std::ops::Deref for HCHANNEL {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HCHANNEL {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HSTREAM(pub DWORD);
impl ::std::ops::Deref for HSTREAM {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HSTREAM {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HRECORD(pub DWORD);
impl ::std::ops::Deref for HRECORD {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HRECORD {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HSYNC(pub DWORD);
impl ::std::ops::Deref for HSYNC {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HSYNC {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HDSP(pub DWORD);
impl ::std::ops::Deref for HDSP {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HDSP {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HFX(pub DWORD);
impl ::std::ops::Deref for HFX {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HFX {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HPLUGIN(pub DWORD);
impl ::std::ops::Deref for HPLUGIN {
	type Target = DWORD;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for HPLUGIN {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[doc = " Device info structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_DEVICEINFO {
	#[doc = " description"]
	pub name: *const ::std::os::raw::c_char,
	#[doc = " driver"]
	pub driver: *const ::std::os::raw::c_char,
	pub flags: DWORD,
}
const _: () = {
	["Size of BASS_DEVICEINFO"][::std::mem::size_of::<BASS_DEVICEINFO>() - 24usize];
	["Alignment of BASS_DEVICEINFO"][::std::mem::align_of::<BASS_DEVICEINFO>() - 8usize];
	["Offset of field: BASS_DEVICEINFO::name"][::std::mem::offset_of!(BASS_DEVICEINFO, name) - 0usize];
	["Offset of field: BASS_DEVICEINFO::driver"][::std::mem::offset_of!(BASS_DEVICEINFO, driver) - 8usize];
	["Offset of field: BASS_DEVICEINFO::flags"][::std::mem::offset_of!(BASS_DEVICEINFO, flags) - 16usize];
};
impl Default for BASS_DEVICEINFO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[repr(C)]
pub struct BASS_INFO {
	#[doc = " device capabilities (DSCAPS_xxx flags)"]
	pub flags: DWORD,
	#[doc = " unused"]
	pub hwsize: DWORD,
	#[doc = " unused"]
	pub hwfree: DWORD,
	#[doc = " unused"]
	pub freesam: DWORD,
	#[doc = " unused"]
	pub free3d: DWORD,
	#[doc = " unused"]
	pub minrate: DWORD,
	#[doc = " unused"]
	pub maxrate: DWORD,
	#[doc = " unused"]
	pub eax: BOOL,
	#[doc = " recommended minimum buffer length in ms"]
	pub minbuf: DWORD,
	#[doc = " DirectSound version"]
	pub dsver: DWORD,
	#[doc = " average delay (in ms) before start of playback"]
	pub latency: DWORD,
	#[doc = " BASS_Init \"flags\" parameter"]
	pub initflags: DWORD,
	#[doc = " number of speakers available"]
	pub speakers: DWORD,
	#[doc = " current output rate"]
	pub freq: DWORD,
}
const _: () = {
	["Size of BASS_INFO"][::std::mem::size_of::<BASS_INFO>() - 56usize];
	["Alignment of BASS_INFO"][::std::mem::align_of::<BASS_INFO>() - 4usize];
	["Offset of field: BASS_INFO::flags"][::std::mem::offset_of!(BASS_INFO, flags) - 0usize];
	["Offset of field: BASS_INFO::hwsize"][::std::mem::offset_of!(BASS_INFO, hwsize) - 4usize];
	["Offset of field: BASS_INFO::hwfree"][::std::mem::offset_of!(BASS_INFO, hwfree) - 8usize];
	["Offset of field: BASS_INFO::freesam"][::std::mem::offset_of!(BASS_INFO, freesam) - 12usize];
	["Offset of field: BASS_INFO::free3d"][::std::mem::offset_of!(BASS_INFO, free3d) - 16usize];
	["Offset of field: BASS_INFO::minrate"][::std::mem::offset_of!(BASS_INFO, minrate) - 20usize];
	["Offset of field: BASS_INFO::maxrate"][::std::mem::offset_of!(BASS_INFO, maxrate) - 24usize];
	["Offset of field: BASS_INFO::eax"][::std::mem::offset_of!(BASS_INFO, eax) - 28usize];
	["Offset of field: BASS_INFO::minbuf"][::std::mem::offset_of!(BASS_INFO, minbuf) - 32usize];
	["Offset of field: BASS_INFO::dsver"][::std::mem::offset_of!(BASS_INFO, dsver) - 36usize];
	["Offset of field: BASS_INFO::latency"][::std::mem::offset_of!(BASS_INFO, latency) - 40usize];
	["Offset of field: BASS_INFO::initflags"][::std::mem::offset_of!(BASS_INFO, initflags) - 44usize];
	["Offset of field: BASS_INFO::speakers"][::std::mem::offset_of!(BASS_INFO, speakers) - 48usize];
	["Offset of field: BASS_INFO::freq"][::std::mem::offset_of!(BASS_INFO, freq) - 52usize];
};
impl Default for BASS_INFO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
impl ::std::fmt::Debug for BASS_INFO {
	fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
		write ! (f , "BASS_INFO {{ flags: {:?}, hwsize: {:?}, hwfree: {:?}, freesam: {:?}, free3d: {:?}, minrate: {:?}, maxrate: {:?}, minbuf: {:?}, dsver: {:?}, latency: {:?}, initflags: {:?}, speakers: {:?}, freq: {:?} }}" , self . flags , self . hwsize , self . hwfree , self . freesam , self . free3d , self . minrate , self . maxrate , self . minbuf , self . dsver , self . latency , self . initflags , self . speakers , self . freq)
	}
}
#[doc = " Recording device info structure"]
#[repr(C)]
pub struct BASS_RECORDINFO {
	#[doc = " device capabilities (DSCCAPS_xxx flags)"]
	pub flags: DWORD,
	#[doc = " supported standard formats (WAVE_FORMAT_xxx flags)"]
	pub formats: DWORD,
	#[doc = " number of inputs"]
	pub inputs: DWORD,
	#[doc = " TRUE = only 1 input can be set at a time"]
	pub singlein: BOOL,
	#[doc = " current input rate"]
	pub freq: DWORD,
}
const _: () = {
	["Size of BASS_RECORDINFO"][::std::mem::size_of::<BASS_RECORDINFO>() - 20usize];
	["Alignment of BASS_RECORDINFO"][::std::mem::align_of::<BASS_RECORDINFO>() - 4usize];
	["Offset of field: BASS_RECORDINFO::flags"][::std::mem::offset_of!(BASS_RECORDINFO, flags) - 0usize];
	["Offset of field: BASS_RECORDINFO::formats"][::std::mem::offset_of!(BASS_RECORDINFO, formats) - 4usize];
	["Offset of field: BASS_RECORDINFO::inputs"][::std::mem::offset_of!(BASS_RECORDINFO, inputs) - 8usize];
	["Offset of field: BASS_RECORDINFO::singlein"][::std::mem::offset_of!(BASS_RECORDINFO, singlein) - 12usize];
	["Offset of field: BASS_RECORDINFO::freq"][::std::mem::offset_of!(BASS_RECORDINFO, freq) - 16usize];
};
impl Default for BASS_RECORDINFO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
impl ::std::fmt::Debug for BASS_RECORDINFO {
	fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
		write!(
			f,
			"BASS_RECORDINFO {{ flags: {:?}, formats: {:?}, inputs: {:?}, freq: {:?} }}",
			self.flags, self.formats, self.inputs, self.freq
		)
	}
}
#[doc = " Sample info structure"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_SAMPLE {
	#[doc = " default playback rate"]
	pub freq: DWORD,
	#[doc = " default volume (0-1)"]
	pub volume: f32,
	#[doc = " default pan (-1=left, 0=middle, 1=right)"]
	pub pan: f32,
	#[doc = " BASS_SAMPLE_xxx flags"]
	pub flags: DWORD,
	#[doc = " length (in bytes)"]
	pub length: DWORD,
	#[doc = " maximum simultaneous playbacks"]
	pub max: DWORD,
	#[doc = " original resolution"]
	pub origres: DWORD,
	#[doc = " number of channels"]
	pub chans: DWORD,
	#[doc = " minimum gap (ms) between creating channels"]
	pub mingap: DWORD,
	#[doc = " BASS_3DMODE_xxx mode"]
	pub mode3d: DWORD,
	#[doc = " minimum distance"]
	pub mindist: f32,
	#[doc = " maximum distance"]
	pub maxdist: f32,
	#[doc = " angle of inside projection cone"]
	pub iangle: DWORD,
	#[doc = " angle of outside projection cone"]
	pub oangle: DWORD,
	#[doc = " delta-volume outside the projection cone"]
	pub outvol: f32,
	#[doc = " unused"]
	pub vam: DWORD,
	#[doc = " unused"]
	pub priority: DWORD,
}
const _: () = {
	["Size of BASS_SAMPLE"][::std::mem::size_of::<BASS_SAMPLE>() - 68usize];
	["Alignment of BASS_SAMPLE"][::std::mem::align_of::<BASS_SAMPLE>() - 4usize];
	["Offset of field: BASS_SAMPLE::freq"][::std::mem::offset_of!(BASS_SAMPLE, freq) - 0usize];
	["Offset of field: BASS_SAMPLE::volume"][::std::mem::offset_of!(BASS_SAMPLE, volume) - 4usize];
	["Offset of field: BASS_SAMPLE::pan"][::std::mem::offset_of!(BASS_SAMPLE, pan) - 8usize];
	["Offset of field: BASS_SAMPLE::flags"][::std::mem::offset_of!(BASS_SAMPLE, flags) - 12usize];
	["Offset of field: BASS_SAMPLE::length"][::std::mem::offset_of!(BASS_SAMPLE, length) - 16usize];
	["Offset of field: BASS_SAMPLE::max"][::std::mem::offset_of!(BASS_SAMPLE, max) - 20usize];
	["Offset of field: BASS_SAMPLE::origres"][::std::mem::offset_of!(BASS_SAMPLE, origres) - 24usize];
	["Offset of field: BASS_SAMPLE::chans"][::std::mem::offset_of!(BASS_SAMPLE, chans) - 28usize];
	["Offset of field: BASS_SAMPLE::mingap"][::std::mem::offset_of!(BASS_SAMPLE, mingap) - 32usize];
	["Offset of field: BASS_SAMPLE::mode3d"][::std::mem::offset_of!(BASS_SAMPLE, mode3d) - 36usize];
	["Offset of field: BASS_SAMPLE::mindist"][::std::mem::offset_of!(BASS_SAMPLE, mindist) - 40usize];
	["Offset of field: BASS_SAMPLE::maxdist"][::std::mem::offset_of!(BASS_SAMPLE, maxdist) - 44usize];
	["Offset of field: BASS_SAMPLE::iangle"][::std::mem::offset_of!(BASS_SAMPLE, iangle) - 48usize];
	["Offset of field: BASS_SAMPLE::oangle"][::std::mem::offset_of!(BASS_SAMPLE, oangle) - 52usize];
	["Offset of field: BASS_SAMPLE::outvol"][::std::mem::offset_of!(BASS_SAMPLE, outvol) - 56usize];
	["Offset of field: BASS_SAMPLE::vam"][::std::mem::offset_of!(BASS_SAMPLE, vam) - 60usize];
	["Offset of field: BASS_SAMPLE::priority"][::std::mem::offset_of!(BASS_SAMPLE, priority) - 64usize];
};
#[doc = " Channel info structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_CHANNELINFO {
	#[doc = " default playback rate"]
	pub freq: DWORD,
	#[doc = " channels"]
	pub chans: DWORD,
	pub flags: DWORD,
	#[doc = " type of channel"]
	pub ctype: DWORD,
	#[doc = " original resolution"]
	pub origres: DWORD,
	pub plugin: HPLUGIN,
	pub sample: HSAMPLE,
	pub filename: *const ::std::os::raw::c_char,
}
const _: () = {
	["Size of BASS_CHANNELINFO"][::std::mem::size_of::<BASS_CHANNELINFO>() - 40usize];
	["Alignment of BASS_CHANNELINFO"][::std::mem::align_of::<BASS_CHANNELINFO>() - 8usize];
	["Offset of field: BASS_CHANNELINFO::freq"][::std::mem::offset_of!(BASS_CHANNELINFO, freq) - 0usize];
	["Offset of field: BASS_CHANNELINFO::chans"][::std::mem::offset_of!(BASS_CHANNELINFO, chans) - 4usize];
	["Offset of field: BASS_CHANNELINFO::flags"][::std::mem::offset_of!(BASS_CHANNELINFO, flags) - 8usize];
	["Offset of field: BASS_CHANNELINFO::ctype"][::std::mem::offset_of!(BASS_CHANNELINFO, ctype) - 12usize];
	["Offset of field: BASS_CHANNELINFO::origres"][::std::mem::offset_of!(BASS_CHANNELINFO, origres) - 16usize];
	["Offset of field: BASS_CHANNELINFO::plugin"][::std::mem::offset_of!(BASS_CHANNELINFO, plugin) - 20usize];
	["Offset of field: BASS_CHANNELINFO::sample"][::std::mem::offset_of!(BASS_CHANNELINFO, sample) - 24usize];
	["Offset of field: BASS_CHANNELINFO::filename"][::std::mem::offset_of!(BASS_CHANNELINFO, filename) - 32usize];
};
impl Default for BASS_CHANNELINFO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_PLUGINFORM {
	#[doc = " channel type"]
	pub ctype: DWORD,
	#[doc = " format description"]
	pub name: *const ::std::os::raw::c_char,
	#[doc = " file extension filter (*.ext1;*.ext2;etc...)"]
	pub exts: *const ::std::os::raw::c_char,
}
const _: () = {
	["Size of BASS_PLUGINFORM"][::std::mem::size_of::<BASS_PLUGINFORM>() - 24usize];
	["Alignment of BASS_PLUGINFORM"][::std::mem::align_of::<BASS_PLUGINFORM>() - 8usize];
	["Offset of field: BASS_PLUGINFORM::ctype"][::std::mem::offset_of!(BASS_PLUGINFORM, ctype) - 0usize];
	["Offset of field: BASS_PLUGINFORM::name"][::std::mem::offset_of!(BASS_PLUGINFORM, name) - 8usize];
	["Offset of field: BASS_PLUGINFORM::exts"][::std::mem::offset_of!(BASS_PLUGINFORM, exts) - 16usize];
};
impl Default for BASS_PLUGINFORM {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_PLUGININFO {
	#[doc = " version (same form as BASS_GetVersion)"]
	pub version: DWORD,
	#[doc = " number of formats"]
	pub formatc: DWORD,
	#[doc = " the array of formats"]
	pub formats: *const BASS_PLUGINFORM,
}
const _: () = {
	["Size of BASS_PLUGININFO"][::std::mem::size_of::<BASS_PLUGININFO>() - 16usize];
	["Alignment of BASS_PLUGININFO"][::std::mem::align_of::<BASS_PLUGININFO>() - 8usize];
	["Offset of field: BASS_PLUGININFO::version"][::std::mem::offset_of!(BASS_PLUGININFO, version) - 0usize];
	["Offset of field: BASS_PLUGININFO::formatc"][::std::mem::offset_of!(BASS_PLUGININFO, formatc) - 4usize];
	["Offset of field: BASS_PLUGININFO::formats"][::std::mem::offset_of!(BASS_PLUGININFO, formats) - 8usize];
};
impl Default for BASS_PLUGININFO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
#[doc = " 3D vector (for 3D positions/velocities/orientations)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_3DVECTOR {
	#[doc = " +=right, -=left"]
	pub x: f32,
	#[doc = " +=up, -=down"]
	pub y: f32,
	#[doc = " +=front, -=behind"]
	pub z: f32,
}
const _: () = {
	["Size of BASS_3DVECTOR"][::std::mem::size_of::<BASS_3DVECTOR>() - 12usize];
	["Alignment of BASS_3DVECTOR"][::std::mem::align_of::<BASS_3DVECTOR>() - 4usize];
	["Offset of field: BASS_3DVECTOR::x"][::std::mem::offset_of!(BASS_3DVECTOR, x) - 0usize];
	["Offset of field: BASS_3DVECTOR::y"][::std::mem::offset_of!(BASS_3DVECTOR, y) - 4usize];
	["Offset of field: BASS_3DVECTOR::z"][::std::mem::offset_of!(BASS_3DVECTOR, z) - 8usize];
};
pub type STREAMPROC = ::std::option::Option<
	unsafe extern "C" fn(
		handle: HSTREAM,
		buffer: *mut ::std::os::raw::c_void,
		length: DWORD,
		user: *mut ::std::os::raw::c_void,
	) -> DWORD,
>;
#[doc = " User file stream callback functions"]
pub type FILECLOSEPROC = ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void)>;
pub type FILELENPROC = ::std::option::Option<unsafe extern "C" fn(user: *mut ::std::os::raw::c_void) -> QWORD>;
pub type FILEREADPROC = ::std::option::Option<
	unsafe extern "C" fn(
		buffer: *mut ::std::os::raw::c_void,
		length: DWORD,
		user: *mut ::std::os::raw::c_void,
	) -> DWORD,
>;
pub type FILESEEKPROC =
	::std::option::Option<unsafe extern "C" fn(offset: QWORD, user: *mut ::std::os::raw::c_void) -> BOOL>;
#[repr(C)]
#[derive(Debug, Default, Hash, PartialEq, Eq)]
pub struct BASS_FILEPROCS {
	pub close: FILECLOSEPROC,
	pub length: FILELENPROC,
	pub read: FILEREADPROC,
	pub seek: FILESEEKPROC,
}
const _: () = {
	["Size of BASS_FILEPROCS"][::std::mem::size_of::<BASS_FILEPROCS>() - 32usize];
	["Alignment of BASS_FILEPROCS"][::std::mem::align_of::<BASS_FILEPROCS>() - 8usize];
	["Offset of field: BASS_FILEPROCS::close"][::std::mem::offset_of!(BASS_FILEPROCS, close) - 0usize];
	["Offset of field: BASS_FILEPROCS::length"][::std::mem::offset_of!(BASS_FILEPROCS, length) - 8usize];
	["Offset of field: BASS_FILEPROCS::read"][::std::mem::offset_of!(BASS_FILEPROCS, read) - 16usize];
	["Offset of field: BASS_FILEPROCS::seek"][::std::mem::offset_of!(BASS_FILEPROCS, seek) - 24usize];
};
pub type DOWNLOADPROC = ::std::option::Option<
	unsafe extern "C" fn(buffer: *const ::std::os::raw::c_void, length: DWORD, user: *mut ::std::os::raw::c_void),
>;
pub type SYNCPROC = ::std::option::Option<
	unsafe extern "C" fn(handle: HSYNC, channel: DWORD, data: DWORD, user: *mut ::std::os::raw::c_void),
>;
#[doc = " Sync callback function.\nhandle : The sync that has occured\nchannel: Channel that the sync occured in\ndata   : Additional data associated with the sync's occurance\nuser   : The 'user' parameter given when calling BASS_ChannelSetSync"]
pub type DSPPROC = ::std::option::Option<
	unsafe extern "C" fn(
		handle: HDSP,
		channel: DWORD,
		buffer: *mut ::std::os::raw::c_void,
		length: DWORD,
		user: *mut ::std::os::raw::c_void,
	),
>;
#[doc = " DSP callback function.\nhandle : The DSP handle\nchannel: Channel that the DSP is being applied to\nbuffer : Buffer to apply the DSP to\nlength : Number of bytes in the buffer\nuser   : The 'user' parameter given when calling BASS_ChannelSetDSP"]
pub type RECORDPROC = ::std::option::Option<
	unsafe extern "C" fn(
		handle: HRECORD,
		buffer: *const ::std::os::raw::c_void,
		length: DWORD,
		user: *mut ::std::os::raw::c_void,
	) -> BOOL,
>;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct tWAVEFORMATEX {
	pub wFormatTag: WORD,
	pub nChannels: WORD,
	pub nSamplesPerSec: DWORD,
	pub nAvgBytesPerSec: DWORD,
	pub nBlockAlign: WORD,
	pub wBitsPerSample: WORD,
	pub cbSize: WORD,
}
const _: () = {
	["Size of tWAVEFORMATEX"][::std::mem::size_of::<tWAVEFORMATEX>() - 18usize];
	["Alignment of tWAVEFORMATEX"][::std::mem::align_of::<tWAVEFORMATEX>() - 1usize];
	["Offset of field: tWAVEFORMATEX::wFormatTag"][::std::mem::offset_of!(tWAVEFORMATEX, wFormatTag) - 0usize];
	["Offset of field: tWAVEFORMATEX::nChannels"][::std::mem::offset_of!(tWAVEFORMATEX, nChannels) - 2usize];
	["Offset of field: tWAVEFORMATEX::nSamplesPerSec"][::std::mem::offset_of!(tWAVEFORMATEX, nSamplesPerSec) - 4usize];
	["Offset of field: tWAVEFORMATEX::nAvgBytesPerSec"]
		[::std::mem::offset_of!(tWAVEFORMATEX, nAvgBytesPerSec) - 8usize];
	["Offset of field: tWAVEFORMATEX::nBlockAlign"][::std::mem::offset_of!(tWAVEFORMATEX, nBlockAlign) - 12usize];
	["Offset of field: tWAVEFORMATEX::wBitsPerSample"][::std::mem::offset_of!(tWAVEFORMATEX, wBitsPerSample) - 14usize];
	["Offset of field: tWAVEFORMATEX::cbSize"][::std::mem::offset_of!(tWAVEFORMATEX, cbSize) - 16usize];
};
#[repr(transparent)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct WAVEFORMATEX(pub tWAVEFORMATEX);
impl ::std::ops::Deref for WAVEFORMATEX {
	type Target = tWAVEFORMATEX;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for WAVEFORMATEX {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct PWAVEFORMATEX(pub *mut tWAVEFORMATEX);
impl ::std::ops::Deref for PWAVEFORMATEX {
	type Target = *mut tWAVEFORMATEX;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for PWAVEFORMATEX {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct LPWAVEFORMATEX(pub *mut tWAVEFORMATEX);
impl ::std::ops::Deref for LPWAVEFORMATEX {
	type Target = *mut tWAVEFORMATEX;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for LPWAVEFORMATEX {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct LPCWAVEFORMATEX(pub *const WAVEFORMATEX);
impl ::std::ops::Deref for LPCWAVEFORMATEX {
	type Target = *const WAVEFORMATEX;
	#[inline]
	fn deref(&self) -> &Self::Target {
		&self.0
	}
}
impl ::std::ops::DerefMut for LPCWAVEFORMATEX {
	#[inline]
	fn deref_mut(&mut self) -> &mut Self::Target {
		&mut self.0
	}
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_CHORUS {
	pub fWetDryMix: f32,
	pub fDepth: f32,
	pub fFeedback: f32,
	pub fFrequency: f32,
	#[doc = " 0=triangle, 1=sine"]
	pub lWaveform: DWORD,
	pub fDelay: f32,
	#[doc = " BASS_DX8_PHASE_xxx"]
	pub lPhase: DWORD,
}
const _: () = {
	["Size of BASS_DX8_CHORUS"][::std::mem::size_of::<BASS_DX8_CHORUS>() - 28usize];
	["Alignment of BASS_DX8_CHORUS"][::std::mem::align_of::<BASS_DX8_CHORUS>() - 4usize];
	["Offset of field: BASS_DX8_CHORUS::fWetDryMix"][::std::mem::offset_of!(BASS_DX8_CHORUS, fWetDryMix) - 0usize];
	["Offset of field: BASS_DX8_CHORUS::fDepth"][::std::mem::offset_of!(BASS_DX8_CHORUS, fDepth) - 4usize];
	["Offset of field: BASS_DX8_CHORUS::fFeedback"][::std::mem::offset_of!(BASS_DX8_CHORUS, fFeedback) - 8usize];
	["Offset of field: BASS_DX8_CHORUS::fFrequency"][::std::mem::offset_of!(BASS_DX8_CHORUS, fFrequency) - 12usize];
	["Offset of field: BASS_DX8_CHORUS::lWaveform"][::std::mem::offset_of!(BASS_DX8_CHORUS, lWaveform) - 16usize];
	["Offset of field: BASS_DX8_CHORUS::fDelay"][::std::mem::offset_of!(BASS_DX8_CHORUS, fDelay) - 20usize];
	["Offset of field: BASS_DX8_CHORUS::lPhase"][::std::mem::offset_of!(BASS_DX8_CHORUS, lPhase) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_COMPRESSOR {
	pub fGain: f32,
	pub fAttack: f32,
	pub fRelease: f32,
	pub fThreshold: f32,
	pub fRatio: f32,
	pub fPredelay: f32,
}
const _: () = {
	["Size of BASS_DX8_COMPRESSOR"][::std::mem::size_of::<BASS_DX8_COMPRESSOR>() - 24usize];
	["Alignment of BASS_DX8_COMPRESSOR"][::std::mem::align_of::<BASS_DX8_COMPRESSOR>() - 4usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fGain"][::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fGain) - 0usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fAttack"][::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fAttack) - 4usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fRelease"][::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fRelease) - 8usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fThreshold"]
		[::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fThreshold) - 12usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fRatio"][::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fRatio) - 16usize];
	["Offset of field: BASS_DX8_COMPRESSOR::fPredelay"]
		[::std::mem::offset_of!(BASS_DX8_COMPRESSOR, fPredelay) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_DISTORTION {
	pub fGain: f32,
	pub fEdge: f32,
	pub fPostEQCenterFrequency: f32,
	pub fPostEQBandwidth: f32,
	pub fPreLowpassCutoff: f32,
}
const _: () = {
	["Size of BASS_DX8_DISTORTION"][::std::mem::size_of::<BASS_DX8_DISTORTION>() - 20usize];
	["Alignment of BASS_DX8_DISTORTION"][::std::mem::align_of::<BASS_DX8_DISTORTION>() - 4usize];
	["Offset of field: BASS_DX8_DISTORTION::fGain"][::std::mem::offset_of!(BASS_DX8_DISTORTION, fGain) - 0usize];
	["Offset of field: BASS_DX8_DISTORTION::fEdge"][::std::mem::offset_of!(BASS_DX8_DISTORTION, fEdge) - 4usize];
	["Offset of field: BASS_DX8_DISTORTION::fPostEQCenterFrequency"]
		[::std::mem::offset_of!(BASS_DX8_DISTORTION, fPostEQCenterFrequency) - 8usize];
	["Offset of field: BASS_DX8_DISTORTION::fPostEQBandwidth"]
		[::std::mem::offset_of!(BASS_DX8_DISTORTION, fPostEQBandwidth) - 12usize];
	["Offset of field: BASS_DX8_DISTORTION::fPreLowpassCutoff"]
		[::std::mem::offset_of!(BASS_DX8_DISTORTION, fPreLowpassCutoff) - 16usize];
};
#[repr(C)]
pub struct BASS_DX8_ECHO {
	pub fWetDryMix: f32,
	pub fFeedback: f32,
	pub fLeftDelay: f32,
	pub fRightDelay: f32,
	pub lPanDelay: BOOL,
}
const _: () = {
	["Size of BASS_DX8_ECHO"][::std::mem::size_of::<BASS_DX8_ECHO>() - 20usize];
	["Alignment of BASS_DX8_ECHO"][::std::mem::align_of::<BASS_DX8_ECHO>() - 4usize];
	["Offset of field: BASS_DX8_ECHO::fWetDryMix"][::std::mem::offset_of!(BASS_DX8_ECHO, fWetDryMix) - 0usize];
	["Offset of field: BASS_DX8_ECHO::fFeedback"][::std::mem::offset_of!(BASS_DX8_ECHO, fFeedback) - 4usize];
	["Offset of field: BASS_DX8_ECHO::fLeftDelay"][::std::mem::offset_of!(BASS_DX8_ECHO, fLeftDelay) - 8usize];
	["Offset of field: BASS_DX8_ECHO::fRightDelay"][::std::mem::offset_of!(BASS_DX8_ECHO, fRightDelay) - 12usize];
	["Offset of field: BASS_DX8_ECHO::lPanDelay"][::std::mem::offset_of!(BASS_DX8_ECHO, lPanDelay) - 16usize];
};
impl Default for BASS_DX8_ECHO {
	fn default() -> Self {
		let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
		unsafe {
			::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
			s.assume_init()
		}
	}
}
impl ::std::fmt::Debug for BASS_DX8_ECHO {
	fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
		write!(
			f,
			"BASS_DX8_ECHO {{ fWetDryMix: {:?}, fFeedback: {:?}, fLeftDelay: {:?}, fRightDelay: {:?} }}",
			self.fWetDryMix, self.fFeedback, self.fLeftDelay, self.fRightDelay
		)
	}
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_FLANGER {
	pub fWetDryMix: f32,
	pub fDepth: f32,
	pub fFeedback: f32,
	pub fFrequency: f32,
	#[doc = " 0=triangle, 1=sine"]
	pub lWaveform: DWORD,
	pub fDelay: f32,
	#[doc = " BASS_DX8_PHASE_xxx"]
	pub lPhase: DWORD,
}
const _: () = {
	["Size of BASS_DX8_FLANGER"][::std::mem::size_of::<BASS_DX8_FLANGER>() - 28usize];
	["Alignment of BASS_DX8_FLANGER"][::std::mem::align_of::<BASS_DX8_FLANGER>() - 4usize];
	["Offset of field: BASS_DX8_FLANGER::fWetDryMix"][::std::mem::offset_of!(BASS_DX8_FLANGER, fWetDryMix) - 0usize];
	["Offset of field: BASS_DX8_FLANGER::fDepth"][::std::mem::offset_of!(BASS_DX8_FLANGER, fDepth) - 4usize];
	["Offset of field: BASS_DX8_FLANGER::fFeedback"][::std::mem::offset_of!(BASS_DX8_FLANGER, fFeedback) - 8usize];
	["Offset of field: BASS_DX8_FLANGER::fFrequency"][::std::mem::offset_of!(BASS_DX8_FLANGER, fFrequency) - 12usize];
	["Offset of field: BASS_DX8_FLANGER::lWaveform"][::std::mem::offset_of!(BASS_DX8_FLANGER, lWaveform) - 16usize];
	["Offset of field: BASS_DX8_FLANGER::fDelay"][::std::mem::offset_of!(BASS_DX8_FLANGER, fDelay) - 20usize];
	["Offset of field: BASS_DX8_FLANGER::lPhase"][::std::mem::offset_of!(BASS_DX8_FLANGER, lPhase) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BASS_DX8_GARGLE {
	#[doc = " Rate of modulation in hz"]
	pub dwRateHz: DWORD,
	#[doc = " 0=triangle, 1=square"]
	pub dwWaveShape: DWORD,
}
const _: () = {
	["Size of BASS_DX8_GARGLE"][::std::mem::size_of::<BASS_DX8_GARGLE>() - 8usize];
	["Alignment of BASS_DX8_GARGLE"][::std::mem::align_of::<BASS_DX8_GARGLE>() - 4usize];
	["Offset of field: BASS_DX8_GARGLE::dwRateHz"][::std::mem::offset_of!(BASS_DX8_GARGLE, dwRateHz) - 0usize];
	["Offset of field: BASS_DX8_GARGLE::dwWaveShape"][::std::mem::offset_of!(BASS_DX8_GARGLE, dwWaveShape) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_I3DL2REVERB {
	#[doc = " [-10000, 0]      default: -1000 mB"]
	pub lRoom: ::std::os::raw::c_int,
	#[doc = " [-10000, 0]      default: 0 mB"]
	pub lRoomHF: ::std::os::raw::c_int,
	#[doc = " [0.0, 10.0]      default: 0.0"]
	pub flRoomRolloffFactor: f32,
	#[doc = " [0.1, 20.0]      default: 1.49s"]
	pub flDecayTime: f32,
	#[doc = " [0.1, 2.0]       default: 0.83"]
	pub flDecayHFRatio: f32,
	#[doc = " [-10000, 1000]   default: -2602 mB"]
	pub lReflections: ::std::os::raw::c_int,
	#[doc = " [0.0, 0.3]       default: 0.007 s"]
	pub flReflectionsDelay: f32,
	#[doc = " [-10000, 2000]   default: 200 mB"]
	pub lReverb: ::std::os::raw::c_int,
	#[doc = " [0.0, 0.1]       default: 0.011 s"]
	pub flReverbDelay: f32,
	#[doc = " [0.0, 100.0]     default: 100.0 %"]
	pub flDiffusion: f32,
	#[doc = " [0.0, 100.0]     default: 100.0 %"]
	pub flDensity: f32,
	#[doc = " [20.0, 20000.0]  default: 5000.0 Hz"]
	pub flHFReference: f32,
}
const _: () = {
	["Size of BASS_DX8_I3DL2REVERB"][::std::mem::size_of::<BASS_DX8_I3DL2REVERB>() - 48usize];
	["Alignment of BASS_DX8_I3DL2REVERB"][::std::mem::align_of::<BASS_DX8_I3DL2REVERB>() - 4usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::lRoom"][::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, lRoom) - 0usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::lRoomHF"][::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, lRoomHF) - 4usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flRoomRolloffFactor"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flRoomRolloffFactor) - 8usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flDecayTime"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flDecayTime) - 12usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flDecayHFRatio"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flDecayHFRatio) - 16usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::lReflections"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, lReflections) - 20usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flReflectionsDelay"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flReflectionsDelay) - 24usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::lReverb"][::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, lReverb) - 28usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flReverbDelay"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flReverbDelay) - 32usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flDiffusion"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flDiffusion) - 36usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flDensity"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flDensity) - 40usize];
	["Offset of field: BASS_DX8_I3DL2REVERB::flHFReference"]
		[::std::mem::offset_of!(BASS_DX8_I3DL2REVERB, flHFReference) - 44usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_PARAMEQ {
	pub fCenter: f32,
	pub fBandwidth: f32,
	pub fGain: f32,
}
const _: () = {
	["Size of BASS_DX8_PARAMEQ"][::std::mem::size_of::<BASS_DX8_PARAMEQ>() - 12usize];
	["Alignment of BASS_DX8_PARAMEQ"][::std::mem::align_of::<BASS_DX8_PARAMEQ>() - 4usize];
	["Offset of field: BASS_DX8_PARAMEQ::fCenter"][::std::mem::offset_of!(BASS_DX8_PARAMEQ, fCenter) - 0usize];
	["Offset of field: BASS_DX8_PARAMEQ::fBandwidth"][::std::mem::offset_of!(BASS_DX8_PARAMEQ, fBandwidth) - 4usize];
	["Offset of field: BASS_DX8_PARAMEQ::fGain"][::std::mem::offset_of!(BASS_DX8_PARAMEQ, fGain) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_DX8_REVERB {
	#[doc = " [-96.0,0.0]            default: 0.0 dB"]
	pub fInGain: f32,
	#[doc = " [-96.0,0.0]            default: 0.0 db"]
	pub fReverbMix: f32,
	#[doc = " [0.001,3000.0]         default: 1000.0 ms"]
	pub fReverbTime: f32,
	#[doc = " [0.001,0.999]          default: 0.001"]
	pub fHighFreqRTRatio: f32,
}
const _: () = {
	["Size of BASS_DX8_REVERB"][::std::mem::size_of::<BASS_DX8_REVERB>() - 16usize];
	["Alignment of BASS_DX8_REVERB"][::std::mem::align_of::<BASS_DX8_REVERB>() - 4usize];
	["Offset of field: BASS_DX8_REVERB::fInGain"][::std::mem::offset_of!(BASS_DX8_REVERB, fInGain) - 0usize];
	["Offset of field: BASS_DX8_REVERB::fReverbMix"][::std::mem::offset_of!(BASS_DX8_REVERB, fReverbMix) - 4usize];
	["Offset of field: BASS_DX8_REVERB::fReverbTime"][::std::mem::offset_of!(BASS_DX8_REVERB, fReverbTime) - 8usize];
	["Offset of field: BASS_DX8_REVERB::fHighFreqRTRatio"]
		[::std::mem::offset_of!(BASS_DX8_REVERB, fHighFreqRTRatio) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct BASS_FX_VOLUME_PARAM {
	pub fTarget: f32,
	pub fCurrent: f32,
	pub fTime: f32,
	pub lCurve: DWORD,
}
const _: () = {
	["Size of BASS_FX_VOLUME_PARAM"][::std::mem::size_of::<BASS_FX_VOLUME_PARAM>() - 16usize];
	["Alignment of BASS_FX_VOLUME_PARAM"][::std::mem::align_of::<BASS_FX_VOLUME_PARAM>() - 4usize];
	["Offset of field: BASS_FX_VOLUME_PARAM::fTarget"][::std::mem::offset_of!(BASS_FX_VOLUME_PARAM, fTarget) - 0usize];
	["Offset of field: BASS_FX_VOLUME_PARAM::fCurrent"]
		[::std::mem::offset_of!(BASS_FX_VOLUME_PARAM, fCurrent) - 4usize];
	["Offset of field: BASS_FX_VOLUME_PARAM::fTime"][::std::mem::offset_of!(BASS_FX_VOLUME_PARAM, fTime) - 8usize];
	["Offset of field: BASS_FX_VOLUME_PARAM::lCurve"][::std::mem::offset_of!(BASS_FX_VOLUME_PARAM, lCurve) - 12usize];
};
pub type IOSNOTIFYPROC = ::std::option::Option<unsafe extern "C" fn(status: DWORD)>;
pub struct BASS {
	__library: ::libloading::Library,
	pub BASS_SetConfig: unsafe extern "C" fn(option: DWORD, value: DWORD) -> BOOL,
	pub BASS_GetConfig: unsafe extern "C" fn(option: DWORD) -> DWORD,
	pub BASS_SetConfigPtr: unsafe extern "C" fn(option: DWORD, value: *const ::std::os::raw::c_void) -> BOOL,
	pub BASS_GetConfigPtr: unsafe extern "C" fn(option: DWORD) -> *const ::std::os::raw::c_void,
	pub BASS_GetVersion: unsafe extern "C" fn() -> DWORD,
	pub BASS_ErrorGetCode: unsafe extern "C" fn() -> ::std::os::raw::c_int,
	pub BASS_GetDeviceInfo: unsafe extern "C" fn(device: DWORD, info: *mut BASS_DEVICEINFO) -> BOOL,
	pub BASS_Init: unsafe extern "C" fn(
		device: ::std::os::raw::c_int,
		freq: DWORD,
		flags: DWORD,
		win: *mut ::std::os::raw::c_void,
